using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;

namespace FinanProject_UI
{
    
    public partial class ps1 : Form
    {
        void pasee(int sum)//ฟังก์ชัน
        {
            double s1;
            //เรียกใช้ pasee(sum);
            if (sum < 150001)//จ่ายภาษี0%
            {
                
                ภาษีที่ต้องจ่าย.Text = "0";
            }
            if (sum >= 150001 && sum < 300001)//จ่ายภาษี5%
            {
                
                s1 = ((sum-150000) * 0.05);
                ภาษีที่ต้องจ่าย.Text = s1.ToString();
            }
            if (sum >= 300001 && sum < 500001)//จ่ายภาษี10%
            {
                
                s1 = ((sum-300000) * (0.10)) + 7500;
                ภาษีที่ต้องจ่าย.Text = s1.ToString();
            }
            if (sum >= 500001 && sum < 750001)//จ่ายภาษี15%
            {
                
                s1 = ((sum-500000) * (0.15)) + 27500;
                ภาษีที่ต้องจ่าย.Text = s1.ToString();
            }
            if (sum >= 750001 && sum < 1000001)//จ่ายภาษี20%
            {
                
                s1 = ((sum-750000) * (0.20)) + 65000;
                ภาษีที่ต้องจ่าย.Text = s1.ToString();
            }
            if (sum >= 1000001 && sum < 2000001)//จ่ายภาษี25%
            {
                
                s1 = ((sum- 1000000) * (0.25)) + 115000;
                ภาษีที่ต้องจ่าย.Text = s1.ToString();
            }
            if (sum >= 2000001 && sum < 5000001)//จ่ายภาษี30%
            {
                
                s1 = ((sum- 2000000) * (0.30)) + 365000;
                ภาษีที่ต้องจ่าย.Text = s1.ToString();

            }
            if (sum >= 5000001)//จ่ายภาษี35%
            {
                s1 = (((sum - 5000000) * (0.35)) + 1265000);
                

                ภาษีที่ต้องจ่าย.Text = s1.ToString();
            }
        }//ฟังก์ชัน
        public ps1()
        {
            InitializeComponent();
            
        }

        private void ps1_Load(object sender, EventArgs e)
        {
            textBox1.Enabled = false;
            numericUpDown1.Enabled = false;
            checkBox1.Enabled = false;
            textBox2.Enabled = false;
            textBox3.Enabled = false;
            radioButton1.Enabled = false;
            radioButton2.Enabled = false;
            radioButton3.Enabled = false;
            radioButton4.Enabled = false;
            radioButton5.Enabled = false;
        }

        private void button1_Click(object sender, EventArgs e)
        {
            int เงินเดือน = int.Parse(textBox4.Text);
            int โบนัส = int.Parse(textBox5.Text);
            int รายได้อื่น = int.Parse(textBox6.Text);
            int มีบุตร61 = int.Parse(numericUpDown1.Text);
            int มีบุตร = int.Parse(textBox1.Text);
            int ค่าฝากครรภ์ = int.Parse(textBox2.Text);
            int อุปการะ = int.Parse(textBox3.Text);
            int เงินเดือนต่อปี1,เงินจ่าย1,เงินสุทธิ1,ภาษี;
            int s1,s2,s3,s4,s5,s6,sum;
            

            เงินเดือนต่อปี1 = เงินเดือน * 12;//เงินเดือนรายปี
            s3 = เงินเดือนต่อปี1 + โบนัส + รายได้อื่น;//เงินรวมตลอดปี
            เงินจ่าย1 = (s3 * 50) / 100;

            string a = comboBox1.SelectedIndex.ToString();
            int สถานะ = int.Parse(a);
            switch (สถานะ)
            {
                case 0:
                    
                    if (เงินจ่าย1<100001 && เงินจ่าย1 >=0)//เงินจ่ายไม่ถึงเเสน
                    {
                        //เตือน6.Text = "เงินจ่ายไม่ถึงเเสน";
                        
                        if(radioButton1.Checked)
                        {
                            sum = s3-เงินจ่าย1-(อุปการะ*60000)-30000-60000;
                            เงินรายปี.Text = s3.ToString();
                            ค่าใช้จ่าย.Text = เงินจ่าย1.ToString();
                            เงินสุทธิ.Text = sum.ToString();
                            pasee(sum);
                            
                        }//พ่อแม่รวม 1 คน
                        if (radioButton2.Checked)
                        {
                            sum = s3 - เงินจ่าย1 - (อุปการะ * 60000) - (30000*2) - 60000;
                            เงินรายปี.Text = s3.ToString();
                            ค่าใช้จ่าย.Text = เงินจ่าย1.ToString();
                            เงินสุทธิ.Text = sum.ToString();
                            //แสดงภาษีที่ต้องจ่ายโดยคำนวณจากเงินสุทธิ
                            pasee(sum);
                            
                        }//พ่อแม่รวม 2 คน
                        if(radioButton5.Checked)//ไม่มีพ่อแม่
                        {
                            sum = s3 - เงินจ่าย1 - (อุปการะ * 60000) - 60000;
                            เงินรายปี.Text = s3.ToString();
                            ค่าใช้จ่าย.Text = เงินจ่าย1.ToString();
                            เงินสุทธิ.Text = sum.ToString();
                            //แสดงภาษีที่ต้องจ่ายโดยคำนวณจากเงินสุทธิ
                            pasee(sum);
                            
                        }//ไม่มีพ่อเเม่
                        

                    }
                    if (เงินจ่าย1 >= 100001)
                    {
                        //เตือน6.Text = "เงินจ่ายเกินเเสน";

                        if (radioButton1.Checked)
                        {
                            sum = s3 - 100000 - (อุปการะ * 60000) - 30000 - 60000;
                            เงินรายปี.Text = s3.ToString();
                            ค่าใช้จ่าย.Text = "100000";
                            เงินสุทธิ.Text = sum.ToString();
                            pasee(sum);
                        }//พ่อแม่รวม 1 คน
                        if (radioButton2.Checked)
                        {
                            sum = s3 - 100000 - (อุปการะ * 60000) - (30000 * 2) - 60000;
                            เงินรายปี.Text = s3.ToString();
                            ค่าใช้จ่าย.Text = "100000";
                            เงินสุทธิ.Text = sum.ToString();
                            pasee(sum);
                        }//พ่อแม่รวม 2 คน
                        if (radioButton5.Checked)//ไม่มีพ่อแม่
                        {
                            sum = s3 - 100000 - (อุปการะ * 60000) - 60000;
                            เงินรายปี.Text = s3.ToString();
                            ค่าใช้จ่าย.Text = "100000";
                            เงินสุทธิ.Text = sum.ToString();
                            pasee(sum);
                        }//ไม่มีพ่อเเม่
                       
                    }

                    break;
                case 1:
                    //หย่า
                    //เตือน6.Text = "หย่า";

                    
                    if(checkBox1.Checked)//กดมีลูกหลัง61
                    {
                        //เตือน6.Text = "กดมีลูกหลัง61";
                        if (เงินจ่าย1 < 100001 && เงินจ่าย1 >= 0)//เงินจ่ายไม่ถึงเเสน
                        {
                            //เตือน6.Text = "เงินจ่ายไม่ถึงเเสน";

                            if (radioButton1.Checked)
                            {
                                sum = s3 - เงินจ่าย1 - (อุปการะ * 60000)-(มีบุตร*30000)-(มีบุตร61*60000) - 30000 - 60000;
                                เงินรายปี.Text = s3.ToString();
                                ค่าใช้จ่าย.Text = เงินจ่าย1.ToString();
                                เงินสุทธิ.Text = sum.ToString();
                                //แสดงภาษีที่ต้องจ่ายโดยคำนวณจากเงินสุทธิ
                                pasee(sum);
                            }//พ่อแม่รวม 1 คน
                            if (radioButton2.Checked)
                            {
                                sum = s3 - เงินจ่าย1 - (อุปการะ * 60000) - (มีบุตร * 30000) - (มีบุตร61 * 60000) - (30000 * 2) - 60000;
                                เงินรายปี.Text = s3.ToString();
                                ค่าใช้จ่าย.Text = เงินจ่าย1.ToString();
                                เงินสุทธิ.Text = sum.ToString();
                                //แสดงภาษีที่ต้องจ่ายโดยคำนวณจากเงินสุทธิ
                                pasee(sum);
                                
                            }//พ่อแม่รวม 2 คน
                            if (radioButton5.Checked)//ไม่มีพ่อแม่
                            {
                                sum = s3 - เงินจ่าย1 - (อุปการะ * 60000) - (มีบุตร * 30000) - (มีบุตร61 * 60000) - 60000;
                                เงินรายปี.Text = s3.ToString();
                                ค่าใช้จ่าย.Text = เงินจ่าย1.ToString();
                                เงินสุทธิ.Text = sum.ToString();
                                //แสดงภาษีที่ต้องจ่ายโดยคำนวณจากเงินสุทธิ
                                pasee(sum);
                                
                            }//ไม่มีพ่อเเม่
                            

                        }//เงินจ่ายไม่ถึงเเสน
                        if (เงินจ่าย1 >= 100001)//เงินจ่ายเกินเเสน
                        {
                            //เตือน6.Text = "เงินจ่ายเกินเเสน";

                            if (radioButton1.Checked)
                            {
                                sum = s3 - 100000 - (อุปการะ * 60000)-(มีบุตร * 30000) - (มีบุตร61 * 60000) - 30000 - 60000;
                                เงินรายปี.Text = s3.ToString();
                                ค่าใช้จ่าย.Text = "100000";
                                เงินสุทธิ.Text = sum.ToString();
                                //แสดงภาษีที่ต้องจ่ายโดยคำนวณจากเงินสุทธิ
                                pasee(sum);
                            }//พ่อแม่รวม 1 คน
                            if (radioButton2.Checked)
                            {
                                sum = s3 - 100000 - (อุปการะ * 60000) - (มีบุตร * 30000) - (มีบุตร61 * 60000) - (30000 * 2) - 60000;
                                เงินรายปี.Text = s3.ToString();
                                ค่าใช้จ่าย.Text = "100000";
                                เงินสุทธิ.Text = sum.ToString();
                                //แสดงภาษีที่ต้องจ่ายโดยคำนวณจากเงินสุทธิ
                                pasee(sum);
                            }//พ่อแม่รวม 2 คน
                            if (radioButton5.Checked)//ไม่มีพ่อแม่
                            {
                                sum = s3 - 100000 - (อุปการะ * 60000) - (มีบุตร * 30000) - (มีบุตร61 * 60000) - 60000;
                                เงินรายปี.Text = s3.ToString();
                                ค่าใช้จ่าย.Text = "100000";
                                เงินสุทธิ.Text = sum.ToString();
                                //แสดงภาษีที่ต้องจ่ายโดยคำนวณจากเงินสุทธิ
                                pasee(sum);
                            }//ไม่มีพ่อเเม่
                            //ใส่เอล
                        }//เงินจ่ายเกินเเสน

                    }
                    else//ไม่กดมีลูกหลัง61
                    {
                        //เตือน6.Text = "ไม่กดมีลูกหลัง61";
                        if (เงินจ่าย1 < 100001 && เงินจ่าย1 >= 0)//เงินจ่ายไม่ถึงเเสน
                        {
                            //เตือน6.Text = "เงินจ่ายไม่ถึงเเสน";

                            if (radioButton1.Checked)
                            {
                                sum = s3 - เงินจ่าย1 - (อุปการะ * 60000) - (มีบุตร * 30000) - 30000 - 60000;
                                เงินรายปี.Text = s3.ToString();
                                ค่าใช้จ่าย.Text = เงินจ่าย1.ToString();
                                เงินสุทธิ.Text = sum.ToString();
                                //แสดงภาษีที่ต้องจ่ายโดยคำนวณจากเงินสุทธิ
                                pasee(sum);
                            }//พ่อแม่รวม 1 คน
                            if (radioButton2.Checked)
                            {
                                sum = s3 - เงินจ่าย1 - (อุปการะ * 60000) - (มีบุตร * 30000) - (30000 * 2) - 60000;
                                เงินรายปี.Text = s3.ToString();
                                ค่าใช้จ่าย.Text = เงินจ่าย1.ToString();
                                เงินสุทธิ.Text = sum.ToString();
                                //แสดงภาษีที่ต้องจ่ายโดยคำนวณจากเงินสุทธิ

                                pasee(sum);
                            }//พ่อแม่รวม 2 คน
                            if (radioButton5.Checked)//ไม่มีพ่อแม่
                            {
                                sum = s3 - เงินจ่าย1 - (อุปการะ * 60000) - (มีบุตร * 30000) - 60000;
                                เงินรายปี.Text = s3.ToString();
                                ค่าใช้จ่าย.Text = เงินจ่าย1.ToString();
                                เงินสุทธิ.Text = sum.ToString();
                                //แสดงภาษีที่ต้องจ่ายโดยคำนวณจากเงินสุทธิ

                                pasee(sum);
                            }//ไม่มีพ่อเเม่
                            
                            

                        }//เงินจ่ายไม่ถึงเเสน
                        if (เงินจ่าย1 >= 100001)//เงินจ่ายเกินเเสน
                        {
                            //เตือน6.Text = "เงินจ่ายเกินเเสน";

                            if (radioButton1.Checked)
                            {
                                sum = s3 - 100000 - (อุปการะ * 60000) - (มีบุตร * 30000) - 30000 - 60000;
                                เงินรายปี.Text = s3.ToString();
                                ค่าใช้จ่าย.Text = "100000";
                                เงินสุทธิ.Text = sum.ToString();
                                //แสดงภาษีที่ต้องจ่ายโดยคำนวณจากเงินสุทธิ
                                pasee(sum);
                            }//พ่อแม่รวม 1 คน
                            if (radioButton2.Checked)
                            {
                                sum = s3 - 100000 - (อุปการะ * 60000) - (มีบุตร * 30000) - (30000 * 2) - 60000;
                                เงินรายปี.Text = s3.ToString();
                                ค่าใช้จ่าย.Text = "100000";
                                เงินสุทธิ.Text = sum.ToString();
                                //แสดงภาษีที่ต้องจ่ายโดยคำนวณจากเงินสุทธิ
                                pasee(sum);
                            }//พ่อแม่รวม 2 คน
                            if (radioButton5.Checked)//ไม่มีพ่อแม่
                            {
                                sum = s3 - 100000 - (อุปการะ * 60000) - (มีบุตร * 30000) - 60000;
                                เงินรายปี.Text = s3.ToString();
                                ค่าใช้จ่าย.Text = "100000";
                                เงินสุทธิ.Text = sum.ToString();
                                //แสดงภาษีที่ต้องจ่ายโดยคำนวณจากเงินสุทธิ

                                pasee(sum);
                            }//ไม่มีพ่อเเม่
                            //ใส่เอล
                        }//เงินจ่ายเกินเเสน
                    }

                    break;
                case 2:
                    //คู่สมรสมีรายได้
                    
                    if (checkBox1.Checked)//กดมีลูกหลัง61
                    {
                        if (เงินจ่าย1 < 100001 && เงินจ่าย1 >= 0)//เงินจ่ายไม่ถึงเเสน
                        {
                            //เตือน6.Text = "เงินจ่ายไม่ถึงเเสน";

                            if (radioButton1.Checked)//พ่อแม่รวม 1 คน
                            {
                                sum = s3 - เงินจ่าย1 - (อุปการะ * 60000) - (มีบุตร * 30000) - (มีบุตร61 * 60000) - (ค่าฝากครรภ์) - 30000 - 60000;
                                เงินรายปี.Text = s3.ToString();
                                ค่าใช้จ่าย.Text = เงินจ่าย1.ToString();
                                เงินสุทธิ.Text = sum.ToString();
                                //แสดงภาษีที่ต้องจ่ายโดยคำนวณจากเงินสุทธิ
                                pasee(sum);
                            }//พ่อแม่รวม 1 คน
                            if (radioButton2.Checked)//พ่อแม่รวม 2 คน
                            {
                                sum = s3 - เงินจ่าย1 - (อุปการะ * 60000) - (มีบุตร * 30000) - (มีบุตร61 * 60000) - (ค่าฝากครรภ์) - (30000 * 2) - 60000;
                                เงินรายปี.Text = s3.ToString();
                                ค่าใช้จ่าย.Text = เงินจ่าย1.ToString();
                                เงินสุทธิ.Text = sum.ToString();
                                //แสดงภาษีที่ต้องจ่ายโดยคำนวณจากเงินสุทธิ

                                pasee(sum);
                            }//พ่อแม่รวม 2 คน
                            if (radioButton3.Checked)//พ่อแม่รวม 3 คน
                            {
                                sum = s3 - เงินจ่าย1 - (อุปการะ * 60000) - (มีบุตร * 30000) - (มีบุตร61 * 60000) - (ค่าฝากครรภ์) - (30000 * 3) - 60000;
                                เงินรายปี.Text = s3.ToString();
                                ค่าใช้จ่าย.Text = เงินจ่าย1.ToString();
                                เงินสุทธิ.Text = sum.ToString();
                                //แสดงภาษีที่ต้องจ่ายโดยคำนวณจากเงินสุทธิ

                                pasee(sum);
                            }//พ่อแม่รวม 3 คน
                            if (radioButton4.Checked)//พ่อแม่รวม 4 คน
                            {
                                sum = s3 - เงินจ่าย1 - (อุปการะ * 60000) - (มีบุตร * 30000) - (มีบุตร61 * 60000) - (ค่าฝากครรภ์) - (30000 * 4) - 60000;
                                เงินรายปี.Text = s3.ToString();
                                ค่าใช้จ่าย.Text = เงินจ่าย1.ToString();
                                เงินสุทธิ.Text = sum.ToString();
                                //แสดงภาษีที่ต้องจ่ายโดยคำนวณจากเงินสุทธิ

                                pasee(sum);
                            }//พ่อแม่รวม 4 คน
                            if (radioButton5.Checked)//ไม่มีพ่อแม่
                            {
                                sum = s3 - เงินจ่าย1 - (อุปการะ * 60000) - (มีบุตร * 30000) - (มีบุตร61 * 60000) - (ค่าฝากครรภ์) - 60000;
                                เงินรายปี.Text = s3.ToString();
                                ค่าใช้จ่าย.Text = เงินจ่าย1.ToString();
                                เงินสุทธิ.Text = sum.ToString();
                                //แสดงภาษีที่ต้องจ่ายโดยคำนวณจากเงินสุทธิ

                                pasee(sum);
                            }//ไม่มีพ่อเเม่
                            //ใส่เอล

                        }//เงินจ่ายไม่ถึงเเสน
                        if (เงินจ่าย1 >= 100001)//เงินจ่ายเกินเเสน
                        {
                            //เตือน6.Text = "เงินจ่ายเกินเเสน";

                            if (radioButton1.Checked)
                            {
                                sum = s3 - 100000 - (อุปการะ * 60000) - (มีบุตร * 30000) - (มีบุตร61 * 60000) - (ค่าฝากครรภ์) - 30000 - 60000;
                                เงินรายปี.Text = s3.ToString();
                                ค่าใช้จ่าย.Text = "100000";
                                เงินสุทธิ.Text = sum.ToString();
                                //แสดงภาษีที่ต้องจ่ายโดยคำนวณจากเงินสุทธิ
                                pasee(sum);
                            }//พ่อแม่รวม 1 คน
                            if (radioButton2.Checked)
                            {
                                sum = s3 - 100000 - (อุปการะ * 60000) - (มีบุตร * 30000) - (มีบุตร61 * 60000) - (ค่าฝากครรภ์) - (30000 * 2) - 60000;
                                เงินรายปี.Text = s3.ToString();
                                ค่าใช้จ่าย.Text = "100000";
                                เงินสุทธิ.Text = sum.ToString();
                                //แสดงภาษีที่ต้องจ่ายโดยคำนวณจากเงินสุทธิ
                                pasee(sum);
                            }//พ่อแม่รวม 2 คน
                            if (radioButton3.Checked)//พ่อแม่รวม 3 คน
                            {
                                sum = s3 - 100000 - (อุปการะ * 60000) - (มีบุตร * 30000) - (มีบุตร61 * 60000) - (ค่าฝากครรภ์) - (30000 * 3) - 60000;
                                เงินรายปี.Text = s3.ToString();
                                ค่าใช้จ่าย.Text = "100000";
                                เงินสุทธิ.Text = sum.ToString();
                                //แสดงภาษีที่ต้องจ่ายโดยคำนวณจากเงินสุทธิ
                                pasee(sum);
                            }//พ่อแม่รวม 3 คน
                            if (radioButton4.Checked)//พ่อแม่รวม 4 คน
                            {
                                sum = s3 - 100000 - (อุปการะ * 60000) - (มีบุตร * 30000) - (มีบุตร61 * 60000) - (ค่าฝากครรภ์) - (30000 * 4) - 60000;
                                เงินรายปี.Text = s3.ToString();
                                ค่าใช้จ่าย.Text = "100000";
                                เงินสุทธิ.Text = sum.ToString();
                                //แสดงภาษีที่ต้องจ่ายโดยคำนวณจากเงินสุทธิ
                                pasee(sum);
                            }//พ่อแม่รวม 4 คน
                            if (radioButton5.Checked)//ไม่มีพ่อแม่
                            {
                                sum = s3 - 100000 - (อุปการะ * 60000) - (มีบุตร * 30000) - (มีบุตร61 * 60000) - (ค่าฝากครรภ์) - 60000;
                                เงินรายปี.Text = s3.ToString();
                                ค่าใช้จ่าย.Text = "100000";
                                เงินสุทธิ.Text = sum.ToString();
                                //แสดงภาษีที่ต้องจ่ายโดยคำนวณจากเงินสุทธิ

                                pasee(sum);
                            }//ไม่มีพ่อเเม่
                            //ใส่เอล
                        }//เงินจ่ายเกินเเสน

                    }
                    else//ไม่กดมีลูกหลัง61
                    {
                        if (เงินจ่าย1 < 100001 && เงินจ่าย1 >= 0)//เงินจ่ายไม่ถึงเเสน
                        {
                            //เตือน6.Text = "เงินจ่ายไม่ถึงเเสน";

                            if (radioButton1.Checked)//พ่อแม่รวม 1 คน
                            {
                                sum = s3 - เงินจ่าย1 - (อุปการะ * 60000) - (มีบุตร * 30000) - (ค่าฝากครรภ์) - 30000 - 60000;
                                เงินรายปี.Text = s3.ToString();
                                ค่าใช้จ่าย.Text = เงินจ่าย1.ToString();
                                เงินสุทธิ.Text = sum.ToString();
                                //แสดงภาษีที่ต้องจ่ายโดยคำนวณจากเงินสุทธิ
                                pasee(sum);
                            }//พ่อแม่รวม 1 คน
                            if (radioButton2.Checked)
                            {
                                sum = s3 - เงินจ่าย1 - (อุปการะ * 60000) - (มีบุตร * 30000) - (30000 * 2) - (ค่าฝากครรภ์) - 60000;
                                เงินรายปี.Text = s3.ToString();
                                ค่าใช้จ่าย.Text = เงินจ่าย1.ToString();
                                เงินสุทธิ.Text = sum.ToString();
                                //แสดงภาษีที่ต้องจ่ายโดยคำนวณจากเงินสุทธิ

                                pasee(sum);
                            }//พ่อแม่รวม 2 คน
                            if (radioButton3.Checked)//พ่อแม่รวม 3 คน
                            {
                                sum = s3 - เงินจ่าย1 - (อุปการะ * 60000) - (มีบุตร * 30000) - (30000 * 3) - (ค่าฝากครรภ์) - 60000;
                                เงินรายปี.Text = s3.ToString();
                                ค่าใช้จ่าย.Text = เงินจ่าย1.ToString();
                                เงินสุทธิ.Text = sum.ToString();
                                //แสดงภาษีที่ต้องจ่ายโดยคำนวณจากเงินสุทธิ

                                pasee(sum);
                            }//พ่อแม่รวม 3 คน
                            if (radioButton4.Checked)//พ่อแม่รวม 4 คน
                            {
                                sum = s3 - เงินจ่าย1 - (อุปการะ * 60000) - (มีบุตร * 30000) - (30000 * 4) - (ค่าฝากครรภ์) - 60000;
                                เงินรายปี.Text = s3.ToString();
                                ค่าใช้จ่าย.Text = เงินจ่าย1.ToString();
                                เงินสุทธิ.Text = sum.ToString();
                                //แสดงภาษีที่ต้องจ่ายโดยคำนวณจากเงินสุทธิ

                                pasee(sum);
                            }//พ่อแม่รวม 4 คน
                            if (radioButton5.Checked)//ไม่มีพ่อแม่
                            {
                                sum = s3 - เงินจ่าย1 - (อุปการะ * 60000) - (มีบุตร * 30000) - (ค่าฝากครรภ์) - 60000;
                                เงินรายปี.Text = s3.ToString();
                                ค่าใช้จ่าย.Text = เงินจ่าย1.ToString();
                                เงินสุทธิ.Text = sum.ToString();
                                //แสดงภาษีที่ต้องจ่ายโดยคำนวณจากเงินสุทธิ

                                pasee(sum);
                            }//ไม่มีพ่อเเม่
                            //ใส่เอล

                        }//เงินจ่ายไม่ถึงเเสน
                        if (เงินจ่าย1 >= 100001)//เงินจ่ายเกินเเสน
                        {
                            //เตือน6.Text = "เงินจ่ายเกินเเสน";

                            if (radioButton1.Checked)//พ่อแม่รวม 1 คน
                            {
                                sum = s3 - 100000 - (อุปการะ * 60000) - (มีบุตร * 30000) - (ค่าฝากครรภ์) - 30000 - 60000;
                                เงินรายปี.Text = s3.ToString();
                                ค่าใช้จ่าย.Text = "100000";
                                เงินสุทธิ.Text = sum.ToString();
                                //แสดงภาษีที่ต้องจ่ายโดยคำนวณจากเงินสุทธิ
                                pasee(sum);
                            }//พ่อแม่รวม 1 คน
                            if (radioButton2.Checked)
                            {
                                sum = s3 - 100000 - (อุปการะ * 60000) - (มีบุตร * 30000) - (ค่าฝากครรภ์) - (30000 * 2) - 60000;
                                เงินรายปี.Text = s3.ToString();
                                ค่าใช้จ่าย.Text = "100000";
                                เงินสุทธิ.Text = sum.ToString();
                                //แสดงภาษีที่ต้องจ่ายโดยคำนวณจากเงินสุทธิ
                                pasee(sum);
                            }//พ่อแม่รวม 2 คน
                            if (radioButton3.Checked)//พ่อแม่รวม 3 คน
                            {
                                sum = s3 - 100000 - (อุปการะ * 60000) - (มีบุตร * 30000) - (ค่าฝากครรภ์) - (30000 * 3) - 60000;
                                เงินรายปี.Text = s3.ToString();
                                ค่าใช้จ่าย.Text = "100000";
                                เงินสุทธิ.Text = sum.ToString();
                                //แสดงภาษีที่ต้องจ่ายโดยคำนวณจากเงินสุทธิ
                                pasee(sum);
                            }//พ่อแม่รวม 3 คน
                            if (radioButton4.Checked)//พ่อแม่รวม 4 คน
                            {
                                sum = s3 - 100000 - (อุปการะ * 60000) - (มีบุตร * 30000) - (ค่าฝากครรภ์) - (30000 * 4) - 60000;
                                เงินรายปี.Text = s3.ToString();
                                ค่าใช้จ่าย.Text = "100000";
                                เงินสุทธิ.Text = sum.ToString();
                                //แสดงภาษีที่ต้องจ่ายโดยคำนวณจากเงินสุทธิ
                                pasee(sum);
                            }//พ่อแม่รวม 4 คน
                            if (radioButton5.Checked)//ไม่มีพ่อแม่
                            {
                                sum = s3 - 100000 - (อุปการะ * 60000) - (มีบุตร * 30000) - (ค่าฝากครรภ์) - 60000;
                                เงินรายปี.Text = s3.ToString();
                                ค่าใช้จ่าย.Text = "100000";
                                เงินสุทธิ.Text = sum.ToString();
                                //แสดงภาษีที่ต้องจ่ายโดยคำนวณจากเงินสุทธิ

                                pasee(sum);
                            }//ไม่มีพ่อเเม่
                            //ใส่เอล
                        }//เงินจ่ายเกินเเสน
                    }
                    break;
                case 3:
                    //คู่สมรสไม่มีรายได้
                    
                    if (checkBox1.Checked)//กดมีลูกหลัง61
                    {
                        if (เงินจ่าย1 < 100001 && เงินจ่าย1 >= 0)//เงินจ่ายไม่ถึงเเสน
                        {
                            //เตือน6.Text = "เงินจ่ายไม่ถึงเเสน";

                            if (radioButton1.Checked)//พ่อแม่รวม 1 คน
                            {
                                sum = s3 - เงินจ่าย1 - (อุปการะ * 60000) - (มีบุตร * 30000) - (มีบุตร61 * 60000) - (ค่าฝากครรภ์) - 30000 - (60000 * 2);
                                เงินรายปี.Text = s3.ToString();
                                ค่าใช้จ่าย.Text = เงินจ่าย1.ToString();
                                เงินสุทธิ.Text = sum.ToString();
                                //แสดงภาษีที่ต้องจ่ายโดยคำนวณจากเงินสุทธิ
                                pasee(sum);
                            }//พ่อแม่รวม 1 คน
                            if (radioButton2.Checked)//พ่อแม่รวม 2 คน
                            {
                                sum = s3 - เงินจ่าย1 - (อุปการะ * 60000) - (มีบุตร * 30000) - (มีบุตร61 * 60000) - (ค่าฝากครรภ์) - (30000 * 2) - (60000 * 2);
                                เงินรายปี.Text = s3.ToString();
                                ค่าใช้จ่าย.Text = เงินจ่าย1.ToString();
                                เงินสุทธิ.Text = sum.ToString();
                                //แสดงภาษีที่ต้องจ่ายโดยคำนวณจากเงินสุทธิ

                                pasee(sum);
                            }//พ่อแม่รวม 2 คน
                            if (radioButton3.Checked)//พ่อแม่รวม 3 คน
                            {
                                sum = s3 - เงินจ่าย1 - (อุปการะ * 60000) - (มีบุตร * 30000) - (มีบุตร61 * 60000) - (ค่าฝากครรภ์) - (30000 * 3) - (60000 * 2);
                                เงินรายปี.Text = s3.ToString();
                                ค่าใช้จ่าย.Text = เงินจ่าย1.ToString();
                                เงินสุทธิ.Text = sum.ToString();
                                //แสดงภาษีที่ต้องจ่ายโดยคำนวณจากเงินสุทธิ

                                pasee(sum);
                            }//พ่อแม่รวม 3 คน
                            if (radioButton4.Checked)//พ่อแม่รวม 4 คน
                            {
                                sum = s3 - เงินจ่าย1 - (อุปการะ * 60000) - (มีบุตร * 30000) - (มีบุตร61 * 60000) - (ค่าฝากครรภ์) - (30000 * 4) - (60000 * 2);
                                เงินรายปี.Text = s3.ToString();
                                ค่าใช้จ่าย.Text = เงินจ่าย1.ToString();
                                เงินสุทธิ.Text = sum.ToString();
                                //แสดงภาษีที่ต้องจ่ายโดยคำนวณจากเงินสุทธิ

                                pasee(sum);
                            }//พ่อแม่รวม 4 คน
                            if (radioButton5.Checked)//ไม่มีพ่อแม่
                            {
                                sum = s3 - เงินจ่าย1 - (อุปการะ * 60000) - (มีบุตร * 30000) - (มีบุตร61 * 60000) - (ค่าฝากครรภ์) - (60000 * 2);
                                เงินรายปี.Text = s3.ToString();
                                ค่าใช้จ่าย.Text = เงินจ่าย1.ToString();
                                เงินสุทธิ.Text = sum.ToString();
                                //แสดงภาษีที่ต้องจ่ายโดยคำนวณจากเงินสุทธิ

                                pasee(sum);
                            }//ไม่มีพ่อเเม่
                            //ใส่เอล

                        }//เงินจ่ายไม่ถึงเเสน
                        if (เงินจ่าย1 >= 100001)//เงินจ่ายเกินเเสน
                        {
                            //เตือน6.Text = "เงินจ่ายเกินเเสน";

                            if (radioButton1.Checked)
                            {
                                sum = s3 - 100000 - (อุปการะ * 60000) - (มีบุตร * 30000) - (มีบุตร61 * 60000) - (ค่าฝากครรภ์) - 30000 - (60000 * 2);
                                เงินรายปี.Text = s3.ToString();
                                ค่าใช้จ่าย.Text = "100000";
                                เงินสุทธิ.Text = sum.ToString();
                                //แสดงภาษีที่ต้องจ่ายโดยคำนวณจากเงินสุทธิ
                                pasee(sum);
                            }//พ่อแม่รวม 1 คน
                            if (radioButton2.Checked)
                            {
                                sum = s3 - 100000 - (อุปการะ * 60000) - (มีบุตร * 30000) - (มีบุตร61 * 60000) - (ค่าฝากครรภ์) - (30000 * 2) - (60000 * 2);
                                เงินรายปี.Text = s3.ToString();
                                ค่าใช้จ่าย.Text = "100000";
                                เงินสุทธิ.Text = sum.ToString();
                                //แสดงภาษีที่ต้องจ่ายโดยคำนวณจากเงินสุทธิ
                                pasee(sum);
                            }//พ่อแม่รวม 2 คน
                            if (radioButton3.Checked)//พ่อแม่รวม 3 คน
                            {
                                sum = s3 - 100000 - (อุปการะ * 60000) - (มีบุตร * 30000) - (มีบุตร61 * 60000) - (ค่าฝากครรภ์) - (30000 * 3) - (60000 * 2);
                                เงินรายปี.Text = s3.ToString();
                                ค่าใช้จ่าย.Text = "100000";
                                เงินสุทธิ.Text = sum.ToString();
                                //แสดงภาษีที่ต้องจ่ายโดยคำนวณจากเงินสุทธิ
                                pasee(sum);
                            }//พ่อแม่รวม 3 คน
                            if (radioButton4.Checked)//พ่อแม่รวม 4 คน
                            {
                                sum = s3 - 100000 - (อุปการะ * 60000) - (มีบุตร * 30000) - (มีบุตร61 * 60000) - (ค่าฝากครรภ์) - (30000 * 4) - (60000 * 2);
                                เงินรายปี.Text = s3.ToString();
                                ค่าใช้จ่าย.Text = "100000";
                                เงินสุทธิ.Text = sum.ToString();
                                //แสดงภาษีที่ต้องจ่ายโดยคำนวณจากเงินสุทธิ
                                pasee(sum);
                            }//พ่อแม่รวม 4 คน
                            if (radioButton5.Checked)//ไม่มีพ่อแม่
                            {
                                sum = s3 - 100000 - (อุปการะ * 60000) - (มีบุตร * 30000) - (มีบุตร61 * 60000) - (ค่าฝากครรภ์) - (60000 * 2);
                                เงินรายปี.Text = s3.ToString();
                                ค่าใช้จ่าย.Text = "100000";
                                เงินสุทธิ.Text = sum.ToString();
                                //แสดงภาษีที่ต้องจ่ายโดยคำนวณจากเงินสุทธิ

                                pasee(sum);
                            }//ไม่มีพ่อเเม่
                            //ใส่เอล
                        }//เงินจ่ายเกินเเสน

                    }
                    else//ไม่กดมีลูกหลัง61
                    {
                        if (เงินจ่าย1 < 100001 && เงินจ่าย1 >= 0)//เงินจ่ายไม่ถึงเเสน
                        {
                            //เตือน6.Text = "เงินจ่ายไม่ถึงเเสน";

                            if (radioButton1.Checked)//พ่อแม่รวม 1 คน
                            {
                                sum = s3 - เงินจ่าย1 - (อุปการะ * 60000) - (มีบุตร * 30000) - (ค่าฝากครรภ์) - 30000 - (60000 * 2);
                                เงินรายปี.Text = s3.ToString();
                                ค่าใช้จ่าย.Text = เงินจ่าย1.ToString();
                                เงินสุทธิ.Text = sum.ToString();
                                //แสดงภาษีที่ต้องจ่ายโดยคำนวณจากเงินสุทธิ
                                pasee(sum);
                            }//พ่อแม่รวม 1 คน
                            if (radioButton2.Checked)
                            {
                                sum = s3 - เงินจ่าย1 - (อุปการะ * 60000) - (มีบุตร * 30000) - (30000 * 2) - (ค่าฝากครรภ์) - (60000 * 2);
                                เงินรายปี.Text = s3.ToString();
                                ค่าใช้จ่าย.Text = เงินจ่าย1.ToString();
                                เงินสุทธิ.Text = sum.ToString();
                                //แสดงภาษีที่ต้องจ่ายโดยคำนวณจากเงินสุทธิ

                                pasee(sum);
                            }//พ่อแม่รวม 2 คน
                            if (radioButton3.Checked)//พ่อแม่รวม 3 คน
                            {
                                sum = s3 - เงินจ่าย1 - (อุปการะ * 60000) - (มีบุตร * 30000) - (30000 * 3) - (ค่าฝากครรภ์) - (60000 * 2);
                                เงินรายปี.Text = s3.ToString();
                                ค่าใช้จ่าย.Text = เงินจ่าย1.ToString();
                                เงินสุทธิ.Text = sum.ToString();
                                //แสดงภาษีที่ต้องจ่ายโดยคำนวณจากเงินสุทธิ

                                pasee(sum);
                            }//พ่อแม่รวม 3 คน
                            if (radioButton3.Checked)//พ่อแม่รวม 4 คน
                            {
                                sum = s3 - เงินจ่าย1 - (อุปการะ * 60000) - (มีบุตร * 30000) - (30000 * 4) - (ค่าฝากครรภ์) - (60000 * 2);
                                เงินรายปี.Text = s3.ToString();
                                ค่าใช้จ่าย.Text = เงินจ่าย1.ToString();
                                เงินสุทธิ.Text = sum.ToString();
                                //แสดงภาษีที่ต้องจ่ายโดยคำนวณจากเงินสุทธิ

                                pasee(sum);
                            }//พ่อแม่รวม 4 คน
                            if (radioButton5.Checked)//ไม่มีพ่อแม่
                            {
                                sum = s3 - เงินจ่าย1 - (อุปการะ * 60000) - (มีบุตร * 30000) - (ค่าฝากครรภ์) - (60000 * 2);
                                เงินรายปี.Text = s3.ToString();
                                ค่าใช้จ่าย.Text = เงินจ่าย1.ToString();
                                เงินสุทธิ.Text = sum.ToString();
                                //แสดงภาษีที่ต้องจ่ายโดยคำนวณจากเงินสุทธิ

                                pasee(sum);
                            }//ไม่มีพ่อเเม่
                            

                        }//เงินจ่ายไม่ถึงเเสน
                        if (เงินจ่าย1 >= 100001)//เงินจ่ายเกินเเสน
                        {
                            //เตือน6.Text = "เงินจ่ายเกินเเสน";

                            if (radioButton1.Checked)//พ่อแม่รวม 1 คน
                            {
                                sum = s3 - 100000 - (อุปการะ * 60000) - (มีบุตร * 30000) - (ค่าฝากครรภ์) - 30000 - (60000 * 2);
                                เงินรายปี.Text = s3.ToString();
                                ค่าใช้จ่าย.Text = "100000";
                                เงินสุทธิ.Text = sum.ToString();
                                //แสดงภาษีที่ต้องจ่ายโดยคำนวณจากเงินสุทธิ
                                pasee(sum);
                            }//พ่อแม่รวม 1 คน
                            if (radioButton2.Checked)
                            {
                                sum = s3 - 100000 - (อุปการะ * 60000) - (มีบุตร * 30000) - (ค่าฝากครรภ์) - (30000 * 2) - (60000 * 2);
                                เงินรายปี.Text = s3.ToString();
                                ค่าใช้จ่าย.Text = "100000";
                                เงินสุทธิ.Text = sum.ToString();
                                //แสดงภาษีที่ต้องจ่ายโดยคำนวณจากเงินสุทธิ
                                pasee(sum);
                            }//พ่อแม่รวม 2 คน
                            if (radioButton3.Checked)//พ่อแม่รวม 3 คน
                            {
                                sum = s3 - 100000 - (อุปการะ * 60000) - (มีบุตร * 30000) - (ค่าฝากครรภ์) - (30000 * 3) - (60000 * 2);
                                เงินรายปี.Text = s3.ToString();
                                ค่าใช้จ่าย.Text = "100000";
                                เงินสุทธิ.Text = sum.ToString();
                                //แสดงภาษีที่ต้องจ่ายโดยคำนวณจากเงินสุทธิ
                                pasee(sum);
                            }//พ่อแม่รวม 3 คน
                            if (radioButton4.Checked)//พ่อแม่รวม 4 คน
                            {
                                sum = s3 - 100000 - (อุปการะ * 60000) - (มีบุตร * 30000) - (ค่าฝากครรภ์) - (30000 * 4) - (60000 * 2);
                                เงินรายปี.Text = s3.ToString();
                                ค่าใช้จ่าย.Text = "100000";
                                เงินสุทธิ.Text = sum.ToString();
                                //แสดงภาษีที่ต้องจ่ายโดยคำนวณจากเงินสุทธิ
                                pasee(sum);
                            }//พ่อแม่รวม 4 คน
                            if (radioButton5.Checked)//ไม่มีพ่อแม่
                            {
                                sum = s3 - 100000 - (อุปการะ * 60000) - (มีบุตร * 30000) - (ค่าฝากครรภ์) - (60000*2);
                                เงินรายปี.Text = s3.ToString();
                                ค่าใช้จ่าย.Text = "100000";
                                เงินสุทธิ.Text = sum.ToString();
                                //แสดงภาษีที่ต้องจ่ายโดยคำนวณจากเงินสุทธิ

                                pasee(sum);
                            }//ไม่มีพ่อเเม่
                            //ใส่เอล
                        }//เงินจ่ายเกินเเสน
                    }
                    break;
                default:
                    เงินรายปี.Text = ".";
                    ค่าใช้จ่าย.Text = ".";
                    เงินสุทธิ.Text = ".";
                    ภาษีที่ต้องจ่าย.Text = ".";
                    เตือน.Text = "X";
                    break;
            }    
        }

        private void button2_Click(object sender, EventArgs e)//ล้าง
        {
            


        }

        private void checkBox1_CheckedChanged(object sender, EventArgs e)//ปุ่มมีลูกหลัง61
        {
            if(checkBox1.Checked)
            {
                numericUpDown1.Enabled = true;
            }
            else
            {
                numericUpDown1.Enabled = false;
            }

        }

        private void comboBox1_SelectedIndexChanged(object sender, EventArgs e)//สถานะ
        {
            string a = comboBox1.SelectedIndex.ToString();
            int สถานะ = int.Parse(a);
            if (สถานะ == 0)//โสด
            {
                radioButton1.Enabled = true;
                radioButton2.Enabled = true;
                radioButton5.Enabled = true;
                textBox3.Enabled = true;

            }
            if (สถานะ == 1)//หย่า
            {
                checkBox1.Enabled = true;
                textBox1.Enabled = true;
                //textBox2.Enabled = true;
                textBox3.Enabled = true;
                radioButton1.Enabled = true;
                radioButton2.Enabled = true;
                radioButton5.Enabled = true;
            }
            if (สถานะ == 2)//เมียมีรายได้
            {
                textBox1.Enabled = true;
                //numericUpDown1.Enabled = false;
                checkBox1.Enabled = true;
                textBox2.Enabled = true;
                textBox3.Enabled = true;
                radioButton1.Enabled = true;
                radioButton2.Enabled = true;
                radioButton3.Enabled = true;
                radioButton4.Enabled = true;
                radioButton5.Enabled = true;
                int ค่าฝากครรภ์ = int.Parse(textBox2.Text);
                int sum = 60000;


            }
            if (สถานะ == 3)//เมียไม่มีรายได้
            {
                textBox1.Enabled = true;
                //numericUpDown1.Enabled = false;
                checkBox1.Enabled = true;
                textBox2.Enabled = true;
                textBox3.Enabled = true;
                radioButton1.Enabled = true;
                radioButton2.Enabled = true;
                radioButton3.Enabled = true;
                radioButton4.Enabled = true;
                radioButton5.Enabled = true;
            }
        }

        private void textBox2_TextChanged(object sender, EventArgs e)
        {

        }

        private void pictureBox5_Click(object sender, EventArgs e)
        {

        }

        private void pictureBox2_Click(object sender, EventArgs e)
        {
            เตือน.Text = "";
            
            เตือน3.Text = "";
            เตือน4.Text = "";
            เตือน5.Text = "";
            textBox1.Text = "0";
            textBox2.Text = "0";
            textBox4.Text = "0";
            textBox5.Text = "0";
            textBox6.Text = "0";
            numericUpDown1.Text = string.Format("0");
            เงินรายปี.Text = "";
            ค่าใช้จ่าย.Text = "";
            เงินสุทธิ.Text = "";
            ภาษีที่ต้องจ่าย.Text = "";
            comboBox1.Text = string.Format("");
            checkBox1.Checked = false;

            textBox1.Enabled = false;
            numericUpDown1.Enabled = false;
            checkBox1.Enabled = false;
            textBox2.Enabled = false;
            textBox3.Enabled = false;
            radioButton1.Enabled = false;
            radioButton2.Enabled = false;
            radioButton3.Enabled = false;
            radioButton4.Enabled = false;
            radioButton5.Enabled = false;
        }

        private void comboBox1_SelectedIndexChanged_1(object sender, EventArgs e)
        {

        }
    }
}
