using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;

namespace FinanProject_UI
{
    public partial class ps2 : Form
    {
        void oees3(int  เงินจ่าย1)
        {
            int เงินเดือน = int.Parse(textBox4.Text);
            int โบนัส = int.Parse(textBox5.Text);
            int รายได้อื่น = int.Parse(textBox6.Text);
            int เงินเดือนต่อปี1, เงินได้15เปอ, ภาษี1;
            int s3, sum;

            int ประกันสังคม = int.Parse(textBox1.Text);
            int ประกันชีวิต = int.Parse(textBox2.Text);
            int เบี้ยสุขภาพบิดามารดา = int.Parse(textBox3.Text);
            int เบี้ยประกันคู่สมรส = int.Parse(textBox7.Text);
            int เงิน_กบข = int.Parse(textBox8.Text);
            int เงินสำรองเลี้ยงชีพ = int.Parse(textBox9.Text);
            int เงิน_กอช = int.Parse(textBox10.Text);
            int ค่าRMF = int.Parse(textBox11.Text);
            int ค่าLTF = int.Parse(textBox12.Text);



            เงินเดือนต่อปี1 = เงินเดือน * 12;//เงินเดือนรายปี
            s3 = เงินเดือนต่อปี1 + โบนัส + รายได้อื่น;//เงินรวมตลอดปี
            
            เงินได้15เปอ = (s3 * 15) / 100;






            เงินเดือนต่อปี1 = เงินเดือน * 12;//เงินเดือนรายปี
            s3 = เงินเดือนต่อปี1 + โบนัส + รายได้อื่น;//เงินรวมตลอดปี
            เงินจ่าย1 = (s3 * 50) / 100;
            เงินได้15เปอ = (s3 * 15) / 100;

            if (เงินจ่าย1 < 100001 && เงินจ่าย1 >= 0)//เงินจ่ายต้องไม่กินเเสน
            {
                if (ประกันสังคม < 9001 && ประกันสังคม >= 0)//ไม่เกิน9000
                {
                    if (ประกันชีวิต < 10001 && ประกันชีวิต >= 0)//ปรกันชีวิต+สุขภาพไม่เกิน150000
                    {
                        if (เบี้ยสุขภาพบิดามารดา < 15001 && เบี้ยสุขภาพบิดามารดา >= 0)//เบี้ยสุขภาพบิดามารดา
                        {
                            oees2(s3, เงินจ่าย1, ประกันสังคม, ประกันชีวิต, เบี้ยสุขภาพบิดามารดา, เบี้ยประกันคู่สมรส, เงิน_กบข, เงินสำรองเลี้ยงชีพ, เงิน_กอช, ค่าRMF, ค่าLTF);
                        }
                        if (เบี้ยสุขภาพบิดามารดา > 15000)//เบี้ยสุขภาพบิดามารดาเกิน
                        {
                            เบี้ยสุขภาพบิดามารดา = 15000;
                            oees2(s3, เงินจ่าย1, ประกันสังคม, ประกันชีวิต, เบี้ยสุขภาพบิดามารดา, เบี้ยประกันคู่สมรส, เงิน_กบข, เงินสำรองเลี้ยงชีพ, เงิน_กอช, ค่าRMF, ค่าLTF);
                        }

                    }
                    if (ประกันชีวิต > 10000)//ปรกันชีวิต+สุขภาพเกิน150000
                    {
                        ประกันชีวิต = 10000;
                        if (เบี้ยสุขภาพบิดามารดา < 15001 && เบี้ยสุขภาพบิดามารดา >= 0)//เบี้ยสุขภาพบิดามารดา
                        {
                            oees2(s3, เงินจ่าย1, ประกันสังคม, ประกันชีวิต, เบี้ยสุขภาพบิดามารดา, เบี้ยประกันคู่สมรส, เงิน_กบข, เงินสำรองเลี้ยงชีพ, เงิน_กอช, ค่าRMF, ค่าLTF);
                        }
                        if (เบี้ยสุขภาพบิดามารดา > 15000)//เบี้ยสุขภาพบิดามารดาเกิน
                        {
                            เบี้ยสุขภาพบิดามารดา = 15000;
                            oees2(s3, เงินจ่าย1, ประกันสังคม, ประกันชีวิต, เบี้ยสุขภาพบิดามารดา, เบี้ยประกันคู่สมรส, เงิน_กบข, เงินสำรองเลี้ยงชีพ, เงิน_กอช, ค่าRMF, ค่าLTF);
                        }

                    }


                }
                if (ประกันสังคม > 9000)//เกิน9000
                {
                    ประกันสังคม = 9000;
                    if (ประกันชีวิต < 10001 && ประกันชีวิต >= 0)//ปรกันชีวิต+สุขภาพไม่เกิน150000
                    {
                        if (เบี้ยสุขภาพบิดามารดา < 15001 && เบี้ยสุขภาพบิดามารดา >= 0)//เบี้ยสุขภาพบิดามารดา
                        {
                            oees2(s3, เงินจ่าย1, ประกันสังคม, ประกันชีวิต, เบี้ยสุขภาพบิดามารดา, เบี้ยประกันคู่สมรส, เงิน_กบข, เงินสำรองเลี้ยงชีพ, เงิน_กอช, ค่าRMF, ค่าLTF);
                        }
                        if (เบี้ยสุขภาพบิดามารดา > 15000)//เบี้ยสุขภาพบิดามารดาเกิน
                        {
                            เบี้ยสุขภาพบิดามารดา = 15000;
                            oees2(s3, เงินจ่าย1, ประกันสังคม, ประกันชีวิต, เบี้ยสุขภาพบิดามารดา, เบี้ยประกันคู่สมรส, เงิน_กบข, เงินสำรองเลี้ยงชีพ, เงิน_กอช, ค่าRMF, ค่าLTF);
                        }

                    }
                    if (ประกันชีวิต > 10000)//ปรกันชีวิต+สุขภาพเกิน150000
                    {
                        ประกันชีวิต = 10000;
                        if (เบี้ยสุขภาพบิดามารดา < 15001 && เบี้ยสุขภาพบิดามารดา >= 0)//เบี้ยสุขภาพบิดามารดา
                        {
                            oees2(s3, เงินจ่าย1, ประกันสังคม, ประกันชีวิต, เบี้ยสุขภาพบิดามารดา, เบี้ยประกันคู่สมรส, เงิน_กบข, เงินสำรองเลี้ยงชีพ, เงิน_กอช, ค่าRMF, ค่าLTF);
                        }
                        if (เบี้ยสุขภาพบิดามารดา > 15000)//เบี้ยสุขภาพบิดามารดาเกิน
                        {
                            เบี้ยสุขภาพบิดามารดา = 15000;
                            oees2(s3, เงินจ่าย1, ประกันสังคม, ประกันชีวิต, เบี้ยสุขภาพบิดามารดา, เบี้ยประกันคู่สมรส, เงิน_กบข, เงินสำรองเลี้ยงชีพ, เงิน_กอช, ค่าRMF, ค่าLTF);
                        }

                    }

                }

            }
            if (เงินจ่าย1 > 100000)//เงินจ่ายเกินเเสน
            {
                เงินจ่าย1 = 100000;
                if (ประกันสังคม < 9001 && ประกันสังคม >= 0)//ไม่เกิน9000
                {
                    if (ประกันชีวิต < 10001 && ประกันชีวิต >= 0)//ปรกันชีวิต+สุขภาพไม่เกิน150000
                    {
                        if (เบี้ยสุขภาพบิดามารดา < 15001 && เบี้ยสุขภาพบิดามารดา >= 0)//เบี้ยสุขภาพบิดามารดา
                        {
                            oees2(s3, เงินจ่าย1, ประกันสังคม, ประกันชีวิต, เบี้ยสุขภาพบิดามารดา, เบี้ยประกันคู่สมรส, เงิน_กบข, เงินสำรองเลี้ยงชีพ, เงิน_กอช, ค่าRMF, ค่าLTF);
                        }
                        if (เบี้ยสุขภาพบิดามารดา > 15000)//เบี้ยสุขภาพบิดามารดาเกิน
                        {
                            เบี้ยสุขภาพบิดามารดา = 15000;
                            oees2(s3, เงินจ่าย1, ประกันสังคม, ประกันชีวิต, เบี้ยสุขภาพบิดามารดา, เบี้ยประกันคู่สมรส, เงิน_กบข, เงินสำรองเลี้ยงชีพ, เงิน_กอช, ค่าRMF, ค่าLTF);
                        }

                    }
                    if (ประกันชีวิต > 10000)//ปรกันชีวิต+สุขภาพเกิน150000
                    {
                        ประกันชีวิต = 10000;
                        if (เบี้ยสุขภาพบิดามารดา < 15001 && เบี้ยสุขภาพบิดามารดา >= 0)//เบี้ยสุขภาพบิดามารดา
                        {
                            oees2(s3, เงินจ่าย1, ประกันสังคม, ประกันชีวิต, เบี้ยสุขภาพบิดามารดา, เบี้ยประกันคู่สมรส, เงิน_กบข, เงินสำรองเลี้ยงชีพ, เงิน_กอช, ค่าRMF, ค่าLTF);
                        }
                        if (เบี้ยสุขภาพบิดามารดา > 15000)//เบี้ยสุขภาพบิดามารดาเกิน
                        {
                            เบี้ยสุขภาพบิดามารดา = 15000;
                            oees2(s3, เงินจ่าย1, ประกันสังคม, ประกันชีวิต, เบี้ยสุขภาพบิดามารดา, เบี้ยประกันคู่สมรส, เงิน_กบข, เงินสำรองเลี้ยงชีพ, เงิน_กอช, ค่าRMF, ค่าLTF);
                        }

                    }


                }
                if (ประกันสังคม > 9000)//เกิน9000
                {
                    ประกันสังคม = 9000;
                    if (ประกันชีวิต < 10001 && ประกันชีวิต >= 0)//ปรกันชีวิต+สุขภาพไม่เกิน150000
                    {
                        if (เบี้ยสุขภาพบิดามารดา < 15001 && เบี้ยสุขภาพบิดามารดา >= 0)//เบี้ยสุขภาพบิดามารดา
                        {
                            oees2(s3, เงินจ่าย1, ประกันสังคม, ประกันชีวิต, เบี้ยสุขภาพบิดามารดา, เบี้ยประกันคู่สมรส, เงิน_กบข, เงินสำรองเลี้ยงชีพ, เงิน_กอช, ค่าRMF, ค่าLTF);
                        }
                        if (เบี้ยสุขภาพบิดามารดา > 15000)//เบี้ยสุขภาพบิดามารดาเกิน
                        {
                            เบี้ยสุขภาพบิดามารดา = 15000;
                            oees2(s3, เงินจ่าย1, ประกันสังคม, ประกันชีวิต, เบี้ยสุขภาพบิดามารดา, เบี้ยประกันคู่สมรส, เงิน_กบข, เงินสำรองเลี้ยงชีพ, เงิน_กอช, ค่าRMF, ค่าLTF);
                        }

                    }
                    if (ประกันชีวิต > 10000)//ปรกันชีวิต+สุขภาพเกิน150000
                    {
                        ประกันชีวิต = 10000;
                        if (เบี้ยสุขภาพบิดามารดา < 15001 && เบี้ยสุขภาพบิดามารดา >= 0)//เบี้ยสุขภาพบิดามารดา
                        {
                            oees2(s3, เงินจ่าย1, ประกันสังคม, ประกันชีวิต, เบี้ยสุขภาพบิดามารดา, เบี้ยประกันคู่สมรส, เงิน_กบข, เงินสำรองเลี้ยงชีพ, เงิน_กอช, ค่าRMF, ค่าLTF);
                        }
                        if (เบี้ยสุขภาพบิดามารดา > 15000)//เบี้ยสุขภาพบิดามารดาเกิน
                        {
                            เบี้ยสุขภาพบิดามารดา = 15000;
                            oees2(s3, เงินจ่าย1, ประกันสังคม, ประกันชีวิต, เบี้ยสุขภาพบิดามารดา, เบี้ยประกันคู่สมรส, เงิน_กบข, เงินสำรองเลี้ยงชีพ, เงิน_กอช, ค่าRMF, ค่าLTF);
                        }

                    }

                }

            }
            else
            {
                เตือน.Text = "กรุณาตรวจสอบเงินเดือนต่อปี,โบนัส,รายได้อื่น";
            }
        }
        void oees2(int s3, int เงินจ่าย1, int ประกันสังคม, int ประกันชีวิต, int เบี้ยสุขภาพบิดามารดา, int เบี้ยประกันคู่สมรส, int เงิน_กบข, int เงินสำรองเลี้ยงชีพ, int เงิน_กอช, int ค่าRMF, int ค่าLTF)
        {
            int เงินเดือน = int.Parse(textBox4.Text);
            int โบนัส = int.Parse(textBox5.Text);
            int รายได้อื่น = int.Parse(textBox6.Text);
            int เงินเดือนต่อปี1, เงินได้15เปอ;
            

            



            เงินเดือนต่อปี1 = เงินเดือน * 12;//เงินเดือนรายปี
            s3 = เงินเดือนต่อปี1 + โบนัส + รายได้อื่น;//เงินรวมตลอดปี
            เงินจ่าย1 = (s3 * 50) / 100;
            เงินได้15เปอ = (s3 * 15) / 100;

            if (เบี้ยประกันคู่สมรส < 10001 && เบี้ยประกันคู่สมรส >= 0)//เบี้ยประกันคู่สมรส
            {
                if (เงิน_กบข < 500001 && เงิน_กบข >= 0)//เงิน_กบข
                {
                    if (เงิน_กบข <= เงินได้15เปอ && เงิน_กบข >= 0)//เงิน_กบข น้อยกว่าเงินจ่าย1
                    {
                        if (เงินสำรองเลี้ยงชีพ < 10001 && เงินสำรองเลี้ยงชีพ >= 0)//เงินสำรองเลี้ยงชีพ
                        {
                            oees1(s3, เงินจ่าย1, ประกันสังคม, ประกันชีวิต, เบี้ยสุขภาพบิดามารดา, เบี้ยประกันคู่สมรส, เงิน_กบข, เงินสำรองเลี้ยงชีพ, เงิน_กอช, ค่าRMF, ค่าLTF);
                        }
                        if (เงินสำรองเลี้ยงชีพ > 10000)//เงินสำรองเลี้ยงชีพเกิน
                        {
                            เงินสำรองเลี้ยงชีพ = 10000;
                            oees1(s3, เงินจ่าย1, ประกันสังคม, ประกันชีวิต, เบี้ยสุขภาพบิดามารดา, เบี้ยประกันคู่สมรส, เงิน_กบข, เงินสำรองเลี้ยงชีพ, เงิน_กอช, ค่าRMF, ค่าLTF);
                        }

                    }
                    if (เงิน_กบข > เงินได้15เปอ)//เงิน_กบข น้อยกว่าเงินจ่าย1
                    {
                        เงิน_กบข = เงินได้15เปอ;
                        if (เงินสำรองเลี้ยงชีพ < 10001 && เงินสำรองเลี้ยงชีพ >= 0)//เงินสำรองเลี้ยงชีพ
                        {
                            oees1(s3, เงินจ่าย1, ประกันสังคม, ประกันชีวิต, เบี้ยสุขภาพบิดามารดา, เบี้ยประกันคู่สมรส, เงิน_กบข, เงินสำรองเลี้ยงชีพ, เงิน_กอช, ค่าRMF, ค่าLTF);
                        }
                        if (เงินสำรองเลี้ยงชีพ > 10000)//เงินสำรองเลี้ยงชีพเกิน
                        {
                            เงินสำรองเลี้ยงชีพ = 10000;
                            oees1(s3, เงินจ่าย1, ประกันสังคม, ประกันชีวิต, เบี้ยสุขภาพบิดามารดา, เบี้ยประกันคู่สมรส, เงิน_กบข, เงินสำรองเลี้ยงชีพ, เงิน_กอช, ค่าRMF, ค่าLTF);
                        }

                    }
                }
                if (เงิน_กบข > 500000)//เงิน_กบข เกิน
                {
                    เงิน_กบข = 500000;
                    if (เงิน_กบข <= เงินได้15เปอ && เงิน_กบข >= 0)//เงิน_กบข น้อยกว่าเงินจ่าย1
                    {
                        if (เงินสำรองเลี้ยงชีพ < 10001 && เงินสำรองเลี้ยงชีพ >= 0)//เงินสำรองเลี้ยงชีพ
                        {
                            oees1(s3, เงินจ่าย1, ประกันสังคม, ประกันชีวิต, เบี้ยสุขภาพบิดามารดา, เบี้ยประกันคู่สมรส, เงิน_กบข, เงินสำรองเลี้ยงชีพ, เงิน_กอช, ค่าRMF, ค่าLTF);
                        }
                        if (เงินสำรองเลี้ยงชีพ > 10000)//เงินสำรองเลี้ยงชีพเกิน
                        {
                            เงินสำรองเลี้ยงชีพ = 10000;
                            oees1(s3, เงินจ่าย1, ประกันสังคม, ประกันชีวิต, เบี้ยสุขภาพบิดามารดา, เบี้ยประกันคู่สมรส, เงิน_กบข, เงินสำรองเลี้ยงชีพ, เงิน_กอช, ค่าRMF, ค่าLTF);
                        }

                    }
                    if (เงิน_กบข > เงินได้15เปอ)//เงิน_กบข น้อยกว่าเงินจ่าย1
                    {
                        เงิน_กบข = เงินได้15เปอ;
                        if (เงินสำรองเลี้ยงชีพ < 10001 && เงินสำรองเลี้ยงชีพ >= 0)//เงินสำรองเลี้ยงชีพ
                        {
                            oees1(s3, เงินจ่าย1, ประกันสังคม, ประกันชีวิต, เบี้ยสุขภาพบิดามารดา, เบี้ยประกันคู่สมรส, เงิน_กบข, เงินสำรองเลี้ยงชีพ, เงิน_กอช, ค่าRMF, ค่าLTF);
                        }
                        if (เงินสำรองเลี้ยงชีพ > 10000)//เงินสำรองเลี้ยงชีพเกิน
                        {
                            เงินสำรองเลี้ยงชีพ = 10000;
                            oees1(s3, เงินจ่าย1, ประกันสังคม, ประกันชีวิต, เบี้ยสุขภาพบิดามารดา, เบี้ยประกันคู่สมรส, เงิน_กบข, เงินสำรองเลี้ยงชีพ, เงิน_กอช, ค่าRMF, ค่าLTF);
                        }

                    }
                }

            }
            if (เบี้ยประกันคู่สมรส > 10000)//เบี้ยประกันคู่สมรสเกิน
            {
                เบี้ยประกันคู่สมรส = 10000;
                if (เงิน_กบข < 500001 && เงิน_กบข >= 0)//เงิน_กบข
                {
                    if (เงิน_กบข <= เงินได้15เปอ && เงิน_กบข >= 0)//เงิน_กบข น้อยกว่าเงินจ่าย1
                    {
                        if (เงินสำรองเลี้ยงชีพ < 10001 && เงินสำรองเลี้ยงชีพ >= 0)//เงินสำรองเลี้ยงชีพ
                        {
                            oees1(s3, เงินจ่าย1, ประกันสังคม, ประกันชีวิต, เบี้ยสุขภาพบิดามารดา, เบี้ยประกันคู่สมรส, เงิน_กบข, เงินสำรองเลี้ยงชีพ, เงิน_กอช, ค่าRMF, ค่าLTF);
                        }
                        if (เงินสำรองเลี้ยงชีพ > 10000)//เงินสำรองเลี้ยงชีพเกิน
                        {
                            เงินสำรองเลี้ยงชีพ = 10000;
                            oees1(s3, เงินจ่าย1, ประกันสังคม, ประกันชีวิต, เบี้ยสุขภาพบิดามารดา, เบี้ยประกันคู่สมรส, เงิน_กบข, เงินสำรองเลี้ยงชีพ, เงิน_กอช, ค่าRMF, ค่าLTF);
                        }

                    }
                    if (เงิน_กบข > เงินได้15เปอ)//เงิน_กบข น้อยกว่าเงินจ่าย1
                    {
                        เงิน_กบข = เงินได้15เปอ;
                        if (เงินสำรองเลี้ยงชีพ < 10001 && เงินสำรองเลี้ยงชีพ >= 0)//เงินสำรองเลี้ยงชีพ
                        {
                            oees1(s3, เงินจ่าย1, ประกันสังคม, ประกันชีวิต, เบี้ยสุขภาพบิดามารดา, เบี้ยประกันคู่สมรส, เงิน_กบข, เงินสำรองเลี้ยงชีพ, เงิน_กอช, ค่าRMF, ค่าLTF);
                        }
                        if (เงินสำรองเลี้ยงชีพ > 10000)//เงินสำรองเลี้ยงชีพเกิน
                        {
                            เงินสำรองเลี้ยงชีพ = 10000;
                            oees1(s3, เงินจ่าย1, ประกันสังคม, ประกันชีวิต, เบี้ยสุขภาพบิดามารดา, เบี้ยประกันคู่สมรส, เงิน_กบข, เงินสำรองเลี้ยงชีพ, เงิน_กอช, ค่าRMF, ค่าLTF);
                        }

                    }
                }
                if (เงิน_กบข > 500000)//เงิน_กบข เกิน
                {
                    เงิน_กบข = 500000;
                    if (เงิน_กบข <= เงินได้15เปอ && เงิน_กบข >= 0)//เงิน_กบข น้อยกว่าเงินจ่าย1
                    {
                        if (เงินสำรองเลี้ยงชีพ < 10001 && เงินสำรองเลี้ยงชีพ >= 0)//เงินสำรองเลี้ยงชีพ
                        {
                            oees1(s3, เงินจ่าย1, ประกันสังคม, ประกันชีวิต, เบี้ยสุขภาพบิดามารดา, เบี้ยประกันคู่สมรส, เงิน_กบข, เงินสำรองเลี้ยงชีพ, เงิน_กอช, ค่าRMF, ค่าLTF);
                        }
                        if (เงินสำรองเลี้ยงชีพ > 10000)//เงินสำรองเลี้ยงชีพเกิน
                        {
                            เงินสำรองเลี้ยงชีพ = 10000;
                            oees1(s3, เงินจ่าย1, ประกันสังคม, ประกันชีวิต, เบี้ยสุขภาพบิดามารดา, เบี้ยประกันคู่สมรส, เงิน_กบข, เงินสำรองเลี้ยงชีพ, เงิน_กอช, ค่าRMF, ค่าLTF);
                        }

                    }
                    if (เงิน_กบข > เงินได้15เปอ)//เงิน_กบข น้อยกว่าเงินจ่าย1
                    {
                        เงิน_กบข = เงินได้15เปอ;
                        if (เงินสำรองเลี้ยงชีพ < 10001 && เงินสำรองเลี้ยงชีพ >= 0)//เงินสำรองเลี้ยงชีพ
                        {
                            oees1(s3, เงินจ่าย1, ประกันสังคม, ประกันชีวิต, เบี้ยสุขภาพบิดามารดา, เบี้ยประกันคู่สมรส, เงิน_กบข, เงินสำรองเลี้ยงชีพ, เงิน_กอช, ค่าRMF, ค่าLTF);
                        }
                        if (เงินสำรองเลี้ยงชีพ > 10000)//เงินสำรองเลี้ยงชีพเกิน
                        {
                            เงินสำรองเลี้ยงชีพ = 10000;
                            oees1(s3, เงินจ่าย1, ประกันสังคม, ประกันชีวิต, เบี้ยสุขภาพบิดามารดา, เบี้ยประกันคู่สมรส, เงิน_กบข, เงินสำรองเลี้ยงชีพ, เงิน_กอช, ค่าRMF, ค่าLTF);
                        }

                    }
                }

            }

        }
        void oees1(int s3, int เงินจ่าย1, int ประกันสังคม, int ประกันชีวิต, int เบี้ยสุขภาพบิดามารดา, int เบี้ยประกันคู่สมรส, int เงิน_กบข, int เงินสำรองเลี้ยงชีพ, int เงิน_กอช, int ค่าRMF, int ค่าLTF)
        {
            
            int เงินเดือน = int.Parse(textBox4.Text);
            int โบนัส = int.Parse(textBox5.Text);
            int รายได้อื่น = int.Parse(textBox6.Text);
            int เงินเดือนต่อปี1, เงินได้15เปอ;
            
            เงินเดือนต่อปี1 = เงินเดือน * 12;//เงินเดือนรายปี
            เงินได้15เปอ = (s3 * 15) / 100;

            if (เงิน_กอช < 13201 && เงิน_กอช >= 0)//เงิน_กอช
            {
                if (ค่าRMF < 500001 && ค่าRMF >= 0)//ค่าRMF 
                {
                    if (ค่าRMF <= เงินได้15เปอ)//s3=เงินได้
                    {
                        if (ค่าLTF < 500001 && ค่าLTF >= 0)//ค่าLTF
                        {
                            oees(s3, เงินจ่าย1, ประกันสังคม, ประกันชีวิต, เบี้ยสุขภาพบิดามารดา, เบี้ยประกันคู่สมรส, เงิน_กบข, เงินสำรองเลี้ยงชีพ, เงิน_กอช, ค่าRMF, ค่าLTF);
                        }
                        if (ค่าLTF > 500000)//ค่าLTF เกิน
                        {
                            ค่าLTF = 500000;
                            oees(s3, เงินจ่าย1, ประกันสังคม, ประกันชีวิต, เบี้ยสุขภาพบิดามารดา, เบี้ยประกันคู่สมรส, เงิน_กบข, เงินสำรองเลี้ยงชีพ, เงิน_กอช, ค่าRMF, ค่าLTF);
                        }

                    }
                    if (ค่าRMF > เงินได้15เปอ)
                    {
                        ค่าRMF = เงินได้15เปอ;
                        if (ค่าLTF < 500001 && ค่าLTF >= 0)//ค่าLTF
                        {
                            oees(s3, เงินจ่าย1, ประกันสังคม, ประกันชีวิต, เบี้ยสุขภาพบิดามารดา, เบี้ยประกันคู่สมรส, เงิน_กบข, เงินสำรองเลี้ยงชีพ, เงิน_กอช, ค่าRMF, ค่าLTF);
                        }
                        if (ค่าLTF > 500000)//ค่าLTF เกิน
                        {
                            ค่าLTF = 500000;
                            oees(s3, เงินจ่าย1, ประกันสังคม, ประกันชีวิต, เบี้ยสุขภาพบิดามารดา, เบี้ยประกันคู่สมรส, เงิน_กบข, เงินสำรองเลี้ยงชีพ, เงิน_กอช, ค่าRMF, ค่าLTF);
                        }

                    }
                }
                if (ค่าRMF > 500000)//ค่าRMF เกิน
                {
                    ค่าRMF = 500000;
                    if (ค่าRMF <= เงินได้15เปอ)//s3=เงินได้
                    {
                        if (ค่าLTF < 500001 && ค่าLTF >= 0)//ค่าLTF
                        {
                            oees(s3, เงินจ่าย1, ประกันสังคม, ประกันชีวิต, เบี้ยสุขภาพบิดามารดา, เบี้ยประกันคู่สมรส, เงิน_กบข, เงินสำรองเลี้ยงชีพ, เงิน_กอช, ค่าRMF, ค่าLTF);
                        }
                        if (ค่าLTF > 500000)//ค่าLTF เกิน
                        {
                            ค่าLTF = 500000;
                            oees(s3, เงินจ่าย1, ประกันสังคม, ประกันชีวิต, เบี้ยสุขภาพบิดามารดา, เบี้ยประกันคู่สมรส, เงิน_กบข, เงินสำรองเลี้ยงชีพ, เงิน_กอช, ค่าRMF, ค่าLTF);
                        }

                    }
                    if (ค่าRMF > เงินได้15เปอ)
                    {
                        ค่าRMF = เงินได้15เปอ;
                        if (ค่าLTF < 500001 && ค่าLTF >= 0)//ค่าLTF
                        {
                            oees(s3, เงินจ่าย1, ประกันสังคม, ประกันชีวิต, เบี้ยสุขภาพบิดามารดา, เบี้ยประกันคู่สมรส, เงิน_กบข, เงินสำรองเลี้ยงชีพ, เงิน_กอช, ค่าRMF, ค่าLTF);
                        }
                        if (ค่าLTF > 500000)//ค่าLTF เกิน
                        {
                            ค่าLTF = 500000;
                            oees(s3, เงินจ่าย1, ประกันสังคม, ประกันชีวิต, เบี้ยสุขภาพบิดามารดา, เบี้ยประกันคู่สมรส, เงิน_กบข, เงินสำรองเลี้ยงชีพ, เงิน_กอช, ค่าRMF, ค่าLTF);
                        }

                    }

                }

            }
            if (เงิน_กอช > 13200)//เงิน_กอช เกิน
            {
                เงิน_กอช = 13200;
                if (ค่าRMF < 500001 && ค่าRMF >= 0)//ค่าRMF 
                {
                    if (ค่าRMF <= เงินได้15เปอ)//s3=เงินได้
                    {
                        if (ค่าLTF < 500001 && ค่าLTF >= 0)//ค่าLTF
                        {
                            oees(s3, เงินจ่าย1, ประกันสังคม, ประกันชีวิต, เบี้ยสุขภาพบิดามารดา, เบี้ยประกันคู่สมรส, เงิน_กบข, เงินสำรองเลี้ยงชีพ, เงิน_กอช, ค่าRMF, ค่าLTF);
                        }
                        if (ค่าLTF > 500000)//ค่าLTF เกิน
                        {
                            ค่าLTF = 500000;
                            oees(s3, เงินจ่าย1, ประกันสังคม, ประกันชีวิต, เบี้ยสุขภาพบิดามารดา, เบี้ยประกันคู่สมรส, เงิน_กบข, เงินสำรองเลี้ยงชีพ, เงิน_กอช, ค่าRMF, ค่าLTF);
                        }

                    }
                    if (ค่าRMF > เงินได้15เปอ)
                    {
                        ค่าRMF = เงินได้15เปอ;
                        if (ค่าLTF < 500001 && ค่าLTF >= 0)//ค่าLTF
                        {
                            oees(s3, เงินจ่าย1, ประกันสังคม, ประกันชีวิต, เบี้ยสุขภาพบิดามารดา, เบี้ยประกันคู่สมรส, เงิน_กบข, เงินสำรองเลี้ยงชีพ, เงิน_กอช, ค่าRMF, ค่าLTF);
                        }
                        if (ค่าLTF > 500000)//ค่าLTF เกิน
                        {
                            ค่าLTF = 500000;
                            oees(s3, เงินจ่าย1, ประกันสังคม, ประกันชีวิต, เบี้ยสุขภาพบิดามารดา, เบี้ยประกันคู่สมรส, เงิน_กบข, เงินสำรองเลี้ยงชีพ, เงิน_กอช, ค่าRMF, ค่าLTF);
                        }

                    }
                }
                if (ค่าRMF > 500000)//ค่าRMF เกิน
                {
                    ค่าRMF = 500000;
                    if (ค่าRMF <= เงินได้15เปอ)//s3=เงินได้
                    {
                        if (ค่าLTF < 500001 && ค่าLTF >= 0)//ค่าLTF
                        {
                            oees(s3, เงินจ่าย1, ประกันสังคม, ประกันชีวิต, เบี้ยสุขภาพบิดามารดา, เบี้ยประกันคู่สมรส, เงิน_กบข, เงินสำรองเลี้ยงชีพ, เงิน_กอช, ค่าRMF, ค่าLTF);
                        }
                        if (ค่าLTF > 500000)//ค่าLTF เกิน
                        {
                            ค่าLTF = 500000;
                            oees(s3, เงินจ่าย1, ประกันสังคม, ประกันชีวิต, เบี้ยสุขภาพบิดามารดา, เบี้ยประกันคู่สมรส, เงิน_กบข, เงินสำรองเลี้ยงชีพ, เงิน_กอช, ค่าRMF, ค่าLTF);
                        }

                    }
                    if (ค่าRMF > เงินได้15เปอ)
                    {
                        ค่าRMF = เงินได้15เปอ;
                        if (ค่าLTF < 500001 && ค่าLTF >= 0)//ค่าLTF
                        {
                            oees(s3, เงินจ่าย1, ประกันสังคม, ประกันชีวิต, เบี้ยสุขภาพบิดามารดา, เบี้ยประกันคู่สมรส, เงิน_กบข, เงินสำรองเลี้ยงชีพ, เงิน_กอช, ค่าRMF, ค่าLTF);
                        }
                        if (ค่าLTF > 500000)//ค่าLTF เกิน
                        {
                            ค่าLTF = 500000;
                            oees(s3, เงินจ่าย1, ประกันสังคม, ประกันชีวิต, เบี้ยสุขภาพบิดามารดา, เบี้ยประกันคู่สมรส, เงิน_กบข, เงินสำรองเลี้ยงชีพ, เงิน_กอช, ค่าRMF, ค่าLTF);
                        }

                    }

                }

            }

        }
        void oees(int s3,int เงินจ่าย1,int ประกันสังคม, int ประกันชีวิต, int เบี้ยสุขภาพบิดามารดา, int เบี้ยประกันคู่สมรส, int เงิน_กบข, int เงินสำรองเลี้ยงชีพ , int เงิน_กอช, int ค่าRMF, int ค่าLTF)
        {
           
            int เงินเดือน = int.Parse(textBox4.Text);
            int โบนัส = int.Parse(textBox5.Text);
            int รายได้อื่น = int.Parse(textBox6.Text);
            int เงินเดือนต่อปี1, เงินได้15เปอ;
            int sum;
            เงินเดือนต่อปี1 = เงินเดือน * 12;//เงินเดือนรายปี      
            เงินได้15เปอ = (s3 * 15) / 100;

            if (ค่าLTF <= เงินได้15เปอ)
            {
                sum = s3 - เงินจ่าย1 - ประกันสังคม - ประกันชีวิต - เบี้ยสุขภาพบิดามารดา - เบี้ยประกันคู่สมรส - เงิน_กบข - เงินสำรองเลี้ยงชีพ - เงิน_กอช - ค่าRMF - ค่าLTF;//เงินสุทธิ
                show3.Text = "เงินสุทธิ " + sum.ToString() + " บาท";
                pasee(sum);
            }
            if (ค่าLTF > เงินได้15เปอ)
            {
                ค่าLTF = เงินได้15เปอ;
                sum = s3 - เงินจ่าย1 - ประกันสังคม - ประกันชีวิต - เบี้ยสุขภาพบิดามารดา - เบี้ยประกันคู่สมรส - เงิน_กบข - เงินสำรองเลี้ยงชีพ - เงิน_กอช - ค่าRMF - ค่าLTF;//เงินสุทธิ
                show3.Text = "เงินสุทธิ " + sum.ToString() + " บาท";
                pasee(sum);
            }
        }//ฟังก์ชันLMF
        void pasee(int sum)//ฟังก์ชัน
        {
            double s1;
            //เรียกใช้ pasee(sum);
           
            if (sum < 150001)//จ่ายภาษี0%
            {
                s1 = 0;
                show4.Text = "ภาษีที่ต้องจ่าย " + s1.ToString() + " บาทต่อปี";
            }
            if (sum >= 150001 && sum < 300001)//จ่ายภาษี5%
            {
                s1 = ((sum - 150000) * 0.05);
                show4.Text = "ภาษีที่ต้องจ่าย " + s1.ToString() + " บาทต่อปี";
            }
            if (sum >= 300001 && sum < 500001)//จ่ายภาษี10%
            {
                s1 = ((sum - 300000) * (0.10)) + 7500;
                show4.Text = "ภาษีที่ต้องจ่าย " + s1.ToString() + " บาทต่อปี";
            }
            if (sum >= 500001 && sum < 750001)//จ่ายภาษี15%
            {
                s1 = ((sum - 500000) * (0.15)) + 27500;
                show4.Text = "ภาษีที่ต้องจ่าย " + s1.ToString() + " บาทต่อปี";
            }
            if (sum >= 750001 && sum < 1000001)//จ่ายภาษี20%
            {
                s1 = ((sum - 750000) * (0.20)) + 65000;
                show4.Text = "ภาษีที่ต้องจ่าย " + s1.ToString() + " บาทต่อปี";
            }
            if (sum >= 1000001 && sum < 2000001)//จ่ายภาษี25%
            {
                s1 = ((sum - 1000000) * (0.25)) + 115000;
                show4.Text = "ภาษีที่ต้องจ่าย " + s1.ToString() + " บาทต่อปี";
            }
            if (sum >= 2000001 && sum < 5000001)//จ่ายภาษี30%
            {
                s1 = ((sum - 2000000) * (0.30)) + 365000;
                show4.Text = "ภาษีที่ต้องจ่าย " + s1.ToString() + " บาทต่อปี";
            }
            if (sum >= 5000001)//จ่ายภาษี35%
            {
                s1 = (((sum - 5000000) * (0.35)) + 1265000);
                show4.Text = "ภาษีที่ต้องจ่าย " + s1.ToString() + " บาทต่อปี";
            }
        }//ฟังก์ชันคำนวณสุทธิ

        void seehees(int สถานะ)//ฟังก์ชันปิดช่องกรอก
        {
            if(สถานะ <3 && สถานะ >= 0)
            {
                textBox1.Enabled = true;
                textBox2.Enabled = true;
                textBox3.Enabled = true;
                //textBox7.Enabled = false;//เบี้ยคู่สมรส
                textBox8.Enabled = true;
                textBox9.Enabled = true;
                textBox10.Enabled = true;
                textBox11.Enabled = true;
                textBox12.Enabled = true;
            }
            else if (สถานะ == 3 )
            {
                textBox1.Enabled = true;
                textBox2.Enabled = true;
                textBox3.Enabled = true;
                textBox7.Enabled = true;//เบี้ยคู่สมรส
                textBox8.Enabled = true;
                textBox9.Enabled = true;
                textBox10.Enabled = true;
                textBox11.Enabled = true;
                textBox12.Enabled = true;
            }
        }
        public ps2()
        {
            InitializeComponent();
        }

        
        private void ps2_Load(object sender, EventArgs e)
        {
            textBox1.Enabled = false;
            textBox2.Enabled = false;
            textBox3.Enabled = false;
            textBox7.Enabled = false;//เบี้ยคู่สมรส
            textBox8.Enabled = false;
            textBox9.Enabled = false;
            textBox10.Enabled = false;
            textBox11.Enabled = false;
            textBox12.Enabled = false;
            
        }

        private void comboBox1_SelectedIndexChanged(object sender, EventArgs e)//ปุ่มสถานะ
        {

            string a = comboBox1.SelectedIndex.ToString();
            int สถานะ = int.Parse(a);
            switch (สถานะ)
            {
                case 0:
                    seehees(สถานะ);
                    break;
                case 1:
                    seehees(สถานะ);
                    break;
                case 2:
                    seehees(สถานะ);
                    break;
                case 3:
                    seehees(สถานะ);
                    break;
                default:
                    break;
            }    
        }

        private void button1_Click(object sender, EventArgs e)
        {
            int เงินเดือน = int.Parse(textBox4.Text);
            int โบนัส = int.Parse(textBox5.Text);
            int รายได้อื่น = int.Parse(textBox6.Text);
            int เงินเดือนต่อปี1, เงินจ่าย1, เงินได้15เปอ, ภาษี1;
            int  s3, sum;

            int ประกันสังคม = int.Parse(textBox1.Text);
            int ประกันชีวิต = int.Parse(textBox2.Text);
            int เบี้ยสุขภาพบิดามารดา = int.Parse(textBox3.Text);
            int เบี้ยประกันคู่สมรส = int.Parse(textBox7.Text);
            int เงิน_กบข = int.Parse(textBox8.Text);
            int เงินสำรองเลี้ยงชีพ = int.Parse(textBox9.Text);
            int เงิน_กอช = int.Parse(textBox10.Text);
            int ค่าRMF = int.Parse(textBox11.Text);
            int ค่าLTF = int.Parse(textBox12.Text);



            เงินเดือนต่อปี1 = เงินเดือน * 12;//เงินเดือนรายปี
            s3 = เงินเดือนต่อปี1 + โบนัส + รายได้อื่น;//เงินรวมตลอดปี
            เงินจ่าย1 = (s3 * 50) / 100;
            เงินได้15เปอ = (s3 * 15) / 100;
            

            show1.Text = "รายได้ต่อปี(เงินเดือน )" + เงินเดือนต่อปี1.ToString() + " บาทต่อปี";
            show2.Text = "ค่าใช้จ่าย " + เงินจ่าย1.ToString() + " บาท";
            
            
            
            //ตรวจสอบสถานะ
            string a = comboBox1.SelectedIndex.ToString();
            int สถานะ = int.Parse(a);
            switch (สถานะ)
            {
                case 0:
                    oees3(เงินจ่าย1);                                            
                    break;
                case 1:
                    oees3(เงินจ่าย1);
                    break;
                case 2:
                    oees3(เงินจ่าย1);
                    break;
                case 3:
                    oees3(เงินจ่าย1);
                    break;
                default:
                    เตือน.Text = "กรุณาเลือกสถานะ";
                    เตือน1.Text = "X";
                    break;
            }

        }

        private void pictureBox1_Click(object sender, EventArgs e)
        {
            textBox1.Text = "0";
            textBox2.Text = "0";
            textBox4.Text = "0";
            textBox5.Text = "0";
            textBox6.Text = "0";
            textBox7.Text = "0";
            textBox8.Text = "0";
            textBox9.Text = "0";
            textBox10.Text = "0";
            textBox11.Text = "0";
            textBox12.Text = "0";
            comboBox1.Text = string.Format("");
            เตือน.Text = "";
            เตือน1.Text = "";
            
            show1.Text = "";
            show2.Text = "";
            show3.Text = "";
            show4.Text = "";

        }

        private void pictureBox2_Click(object sender, EventArgs e)
        {
            Application.Exit();
        }
    }
}
